Revit 2026 API

# IExternalCommand Interface

---

An interface that should be implemented to provide the implementation for a Revit add-in External Command.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IExternalCommand
```
```vb
Public Interface IExternalCommand
```
```cpp
public interface class IExternalCommand
```
```fsharp
type IExternalCommand = interface end
```

The IExternalCommand type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Overload this method to implement and external command within Revit. |

To add an external command to Autodesk Revit the developer should implement an object that supports the IExternalCommand interface.

#### Reference

Autodesk.Revit.UI Namespace